"""
    Виконавець: Олександр Яценко
    Homework II - I рівень складності

    Цей скрипт виконує гру FizzBuzz у заданому діапазоні чисел від користувача.

    Перш за все, ініціалізуються два порожні списки: `list_numbers` для
    зберігання чисел у діапазоні
    та `fizz_buzz` для зберігання результатів гри FizzBuzz.

    Користувачу пропонується ввести стартове (`num_start`) та кінцеве (
    `num_end`) числа діапазону.
    Ці числа перевіряються, щоб впевнитися, що стартове число не нуль і
    кінцеве число більше за стартове.

    Якщо умови виконуються, код генерує список `list_numbers` з числами від
    `num_start` до `num_end` включно.
    Далі ці числа обробляються: кожне число перевіряється на кратність 3, 5,
    або обом. На основі цього визначення:
    - Якщо число кратне і 3, і 5, воно замінюється на "FizzBuzz".
    - Якщо число кратне тільки 3, воно замінюється на "Fizz".
    - Якщо число кратне тільки 5, воно замінюється на "Buzz".
    - Якщо не відповідає жодній умові, число залишається без змін.

    В кінці, якщо скрипт виконується як головна програма, виводиться список
    `fizz_buzz` з результатами.

    Package version:
    pip - v23.3.1
"""

list_numbers = list()
fizz_buzz = list()

num_start = int(input('Введіть стартове число: '))
num_end = int(input('Введіть кінцеве число: '))


if num_start != 0 and num_end > num_start:
    for i in range(num_start, num_end + 1):
        list_numbers.append(i)

if len(list_numbers) != 0:
    for i in list_numbers:
        if i % 3 == 0 and i % 5 == 0:
            fizz_buzz.append("FizzBuzz")
        elif i % 3 == 0:
            fizz_buzz.append('Fizz')
        elif i % 5 == 0:
            fizz_buzz.append('Buzz')
        else:
            fizz_buzz.append(i)


if __name__ == "__main__":
    print(f'Результат: {fizz_buzz}')
